{
    "about-title": "About Me",
    "about-intro": "I am <strong className=\"text-accent\">Giuseppe</strong>, a <i>front-end</i> developer with <i>junior full stack</i> skills and a web designer. I love every aspect of development, from designing a website's visuals to writing the code that brings its functionality to life. My biggest motivation is to face challenges that allow me to push my limits and constantly improve. For this reason, I dedicate time to practice and expand my skills, exploring <i>back-end</i>, <i>CMS</i>, and design.",
    "about-education": "I graduated in <strong className=\"text-accent\">DAMS</strong> (Disciplines of Arts, Music, and Entertainment), focusing on <i>Design</i> and <i>Computer Science</i>. Later, I took courses in <i>programming</i> and <i>UX/UI Design</i>, which led me to work as an <strong className=\"text-accent\">Interactive Developer</strong> for <strong className=\"text-accent\">Stellantis</strong>, where I completed an internship. In this experience, I gained not only technical skills but also essential soft skills, learning to manage responsibilities and work in a global business environment.",
    "about-dream": "My dream? To develop an application that not only improves people's lives but also leaves a positive impact on the world, simplifying the small daily challenges. I want to create a <strong className=\"text-accent\">tool</strong> that will guide us toward a <strong className=\"text-accent\">technological future</strong>, where <strong className=\"text-accent\">technology</strong> will be a fundamental pillar in building a <strong className=\"text-accent\">sustainable</strong> and <strong className=\"text-accent\">advanced</strong> world.",
    "about-quote": "“Roads? Where we’re going, we don’t need roads!”",
    "about-quote-author": "- Back to the Future",
    "about-cta-1":"Contact me",
    "about-title-skills":"Technical skills",
    "about-hobby": "In my free time, I play the <strong>guitar</strong>, take vintage photos with my <strong>Polaroid</strong>, and work out at the gym. I’m passionate about <strong className=\"text-accent\">rock</strong> music and love '80s cinema.",
    "about-design": "In design, I aim to combine <strong className=\"text-accent\">aesthetics</strong> and <strong className=\"text-accent\">functionality</strong>, creating modern, intuitive, and <i>responsive</i> interfaces. I use tools like <strong className=\"text-accent\">Figma</strong> for visual design and rely on <i>usability</i> principles to ensure an optimal user experience. I believe that a well-designed interface is the perfect bridge between an idea and its technical realization.",
    "about-engine": "My development process is based on a solid understanding of <strong className=\"text-accent\">programming languages</strong> and a structured methodology. I analyze the functions to develop, design them in <i>pseudo-code</i>, and go through a thorough <strong>testing</strong> phase. The goal? To create scalable, interactive, and well-functioning applications.",
    "about-skills": "I have excellent integration skills in multicultural teams and prefer an organized and methodical approach to work. I am resilient under stress and believe in the importance of maintaining a positive attitude, turning every difficulty into an opportunity to grow my knowledge. During brainstorming and design phases, I love to take notes, create diagrams, and make <i>To-Do lists</i> to optimize the process. I believe that <strong className=\"text-accent\">education</strong> and <strong className=\"text-accent\">empathy</strong> are essential, because a kind gesture can make all the difference.",
    "about-cta-2":"CV in PDF"
  }
  