{
    "about-title": "Quién Soy",
    "about-intro": "Soy <strong className=\"text-accent\">Giuseppe</strong>, desarrollador <i>front-end</i> con habilidades de <i>full stack junior</i> y diseñador web. Amo cada aspecto del desarrollo, desde el diseño visual de un sitio hasta escribir el código que da vida a sus funcionalidades. Mi mayor motivación es enfrentar desafíos que me permitan superar mis límites y mejorar constantemente. Por eso, dedico tiempo a practicar y ampliar mis competencias, explorando el <i>back-end</i>, los <i>CMS</i> y el diseño.",
    "about-education": "Me gradué en <strong className=\"text-accent\">DAMS</strong> (Disciplinas de las Artes, Música y Espectáculo), profundizando en <i>Diseño</i> e <i>Informática</i>. Posteriormente, realicé cursos de <i>programación</i> y <i>UX/UI Design</i>, que me llevaron a trabajar como <strong className=\"text-accent\">Desarrollador Interactivo</strong> para <strong className=\"text-accent\">Stellantis</strong>, donde realicé unas prácticas formativas. En esta experiencia, adquirí no solo competencias técnicas, sino también habilidades blandas fundamentales, aprendiendo a asumir responsabilidades y a trabajar en un contexto empresarial global.",
    "about-dream": "¿Mi sueño? Desarrollar una aplicación que no solo mejore la vida de las personas, sino que deje un impacto positivo en el mundo, simplificando los pequeños desafíos cotidianos. Deseo crear una <strong className=\"text-accent\">herramienta</strong> que nos lleve hacia el <strong className=\"text-accent\">futuro tecnológico</strong>, donde la <strong className=\"text-accent\">tecnología</strong> sea un pilar fundamental para construir un mundo <strong className=\"text-accent\">sostenible</strong> y <strong className=\"text-accent\">avanzado</strong>.",
    "about-quote": "“¿Carreteras? ¡A donde vamos, no necesitamos carreteras!”",
    "about-quote-author": "- Regreso al futuro",
    "about-cta-1": "Contáctame",
    "about-title-skills": "Competencias técnicas",
    "about-hobby": "En mi tiempo libre, toco la <strong>guitarra</strong>, tomo fotos vintage con mi <strong>Polaroid</strong> y hago ejercicio en el gimnasio. Soy un apasionado de la música <strong className=\"text-accent\">rock</strong> y me encanta el cine de los años '80.",
    "about-design": "En el diseño, busco combinar <strong className=\"text-accent\">estética</strong> y <strong className=\"text-accent\">funcionalidad</strong>, creando interfaces modernas, intuitivas y <i>responsive</i>. Utilizo herramientas como <strong className=\"text-accent\">Figma</strong> para el diseño visual y me baso en principios de <i>usabilidad</i> para garantizar una experiencia de usuario óptima. Creo que un buen diseño es el puente perfecto entre la idea y su realización técnica.",
    "about-engine": "Mi proceso de desarrollo se basa en un sólido conocimiento de los <strong className=\"text-accent\">lenguajes de programación</strong> y un método estructurado. Analizo las funciones a desarrollar, las diseño en <i>pseudocódigo</i> y sigo una fase de <strong>pruebas</strong> rigurosa. ¿El objetivo? Crear aplicaciones escalables, interactivas y funcionales.",
    "about-skills": "Tengo excelentes habilidades para integrarme en equipos multiculturales y prefiero un enfoque organizado y metódico en el trabajo. Soy resiliente incluso bajo presión y creo en la importancia de mantener una actitud positiva, transformando cada dificultad en una oportunidad para aumentar mis conocimientos. Durante las sesiones de lluvia de ideas y diseño, me gusta tomar notas, crear esquemas y <i>listas de tareas</i> para optimizar el proceso. Considero que la <strong className=\"text-accent\">educación</strong> y la <strong className=\"text-accent\">empatía</strong> son fundamentales, porque un gesto de amabilidad puede marcar la diferencia.",
    "cv-version": "<i>El PDF del currículum estará en español. Puedes descargarlo en otros idiomas consultando el pie de página.</i>",
    "about-cta-2": "CV en PDF"
}
