{
    "about-title": "Chi Sono",
    "about-intro": "Sono <strong className=\"text-accent\">Giuseppe</strong>, sviluppatore <i>front-end</i> con competenze <i>full stack junior</i> e web designer. Amo ogni aspetto dello sviluppo, dalla progettazione visiva di un sito alla scrittura del codice che ne realizza le funzionalità. La mia più grande motivazione è affrontare sfide che mi permettano di superare i miei limiti e migliorarmi costantemente. Per questo, dedico tempo all’esercizio e all’ampliamento delle mie competenze, esplorando il <i>back-end</i>, i <i>CMS</i> e il design.",
    "about-education": "Mi sono laureato in <strong className=\"text-accent\">DAMS</strong> (Discipline delle Arti, Musica e Spettacolo), approfondendo <i>Design</i> e <i>Informatica</i>. Successivamente, ho seguito corsi di <i>programmazione</i> e <i>UX/UI Design</i>, che mi hanno portato a lavorare come <strong className=\"text-accent\">Interactive Developer</strong> per <strong className=\"text-accent\">Stellantis</strong>, dove ho svolto un tirocinio formativo. In questa esperienza, ho acquisito non solo competenze tecniche, ma anche soft skill fondamentali, imparando a gestire responsabilità e a lavorare in un contesto aziendale globale.",
    "about-dream": "Il mio sogno? Sviluppare un’applicazione che non solo migliori la vita delle persone, ma che lasci un impatto positivo sul mondo, semplificando le piccole sfide quotidiane. Desidero creare uno <strong className=\"text-accent\">strumento</strong> che ci traghetti verso il <strong className=\"text-accent\">futuro tecnologico</strong>, dove la <strong className=\"text-accent\">tecnologia</strong> sarà un pilastro fondamentale per costruire un mondo <strong className=\"text-accent\">sostenibile</strong> e <strong className=\"text-accent\">avanzato</strong>.",
    "about-quote": "“Strade? Dove stiamo andando, non c’è bisogno di strade!”",
    "about-quote-author": "- Ritorno al futuro",
    "about-cta-1":"Contattami",
    "about-title-skills":"Competenze tecniche",
    "about-hobby": "Nel tempo libero, suono la <strong>chitarra</strong>, scatto foto vintage con la mia <strong>Polaroid</strong> e mi alleno in palestra. Sono appassionato di musica <strong className=\"text-accent\">rock</strong> e adoro il cinema degli anni '80.",
    "about-design": "Nel design punto a combinare <strong className=\"text-accent\">estetica</strong> e <strong className=\"text-accent\">funzionalità</strong>, creando interfacce moderne, intuitive e <i>responsive</i>. Utilizzo strumenti come <strong className=\"text-accent\">Figma</strong> per la progettazione visiva e mi affido a principi di <i>usabilità</i> per garantire un’esperienza utente ottimale. Credo che un design ben studiato sia il ponte perfetto tra l’idea e la sua realizzazione tecnica.",
    "about-engine": "Il mio processo di sviluppo si fonda su una solida conoscenza dei <strong className=\"text-accent\">linguaggi di programmazione</strong> e su un metodo strutturato. Analizzo le funzioni da sviluppare, le progetto in <i>pseudo codice</i> e seguo una fase di <strong>testing</strong> accurata. L’obiettivo? Creare applicazioni scalabili, interattive e ben funzionanti.",
    "about-skills": "Ho ottime capacità di integrazione in team multiculturali e prediligo un approccio organizzato e metodico al lavoro. Sono resiliente anche sotto stress e credo nell'importanza di mantenere un atteggiamento positivo, trasformando ogni difficoltà in un'opportunità per accrescere le mie conoscenze. Durante brainstorming e progettazione, adoro prendere appunti, creare schemi e <i>To-Do list</i> per ottimizzare il processo. Ritengo che <strong className=\"text-accent\">educazione</strong> ed <strong className=\"text-accent\">empatia</strong> siano fondamentali, perché un gesto di gentilezza può fare la differenza.",
     "about-cta-2":"CV in PDF"
  }
  